Repository: zhy65401/goodToNote
Catalog: GoodToNote/Localizable.xcstrings
Source language: en
Languages: zh_hans

# 模版已保存，但用示例自检时未能重新识别。你可以稍后在模版列表里编辑。
source: Template saved, but it couldn't re-recognize the sample. You can edit it later in the template list.
zh_hans: 模版已保存，但用示例自检时未能重新识别。你可以稍后在模版列表里编辑。

# 模版设置
source: Template Settings
zh_hans: 模版设置

# 欢迎使用 5分钱
source: Welcome to 5 cents
zh_hans: 欢迎使用 5分钱

# 每周
source: Weekly
zh_hans: 每周

# 每天
source: Daily
zh_hans: 每天

# 每年
source: Yearly
zh_hans: 每年

# 每月
source: Monthly
zh_hans: 每月

# 每来一封记账邮件会有一条系统通知,属正常。
source: Each bookkeeping email shows a system notification — that's normal.
zh_hans: 每来一封记账邮件会有一条系统通知,属正常。

# 每次启动会自动备份到「文件 → 我的 iPhone → 5分钱 → Backups」，为单个 %@ 文件，可拷到 iCloud Drive / 电脑存档。
source: On each launch a backup is saved to Files → On My iPhone → 5 cents → Backups as a single %@ file, which you can copy to iCloud Drive or your computer.
zh_hans: 每次启动会自动备份到「文件 → 我的 iPhone → 5分钱 → Backups」，为单个 %@ 文件，可拷到 iCloud Drive / 电脑存档。

# 每次自动记账会有一条系统通知,属正常。
source: Each auto-record shows a system notification — that's normal.
zh_hans: 每次自动记账会有一条系统通知,属正常。

# 水电气
source: Utilities
zh_hans: 水电气

# 汇率 1 %@ =
source: Rate 1 %@ =
zh_hans: 汇率 1 %@ =

# 没收到? 检查:自动化是否已开、关键词是否填对、运行方式是否选了「立即运行」。可随时回到「设置 ▸ 短信自动记账」重做。
source: Nothing showed up? Check: the automation is on, the keyword is correct, and "Run Immediately" is selected. You can redo this any time from Settings ▸ SMS Auto-Logging.
zh_hans: 没收到? 检查:自动化是否已开、关键词是否填对、运行方式是否选了「立即运行」。可随时回到「设置 ▸ 短信自动记账」重做。

# 没收到?检查自动化已开、关键词填对、选了「立即运行 / Run Immediately」。
source: Nothing arrived? Check that the automation is on, the keyword is correct, and you chose “Run Immediately”.
zh_hans: 没收到?检查自动化已开、关键词填对、选了「立即运行 / Run Immediately」。

# 没有可用的短信模版,无法生成关键词。请先到「设置 ▸ 短信模版」添加一个模版。
source: No usable SMS template, so no keyword could be generated. Add a template first in Settings ▸ SMS Templates.
zh_hans: 没有可用的短信模版,无法生成关键词。请先到「设置 ▸ 短信模版」添加一个模版。

# 没有待确认
source: Nothing pending
zh_hans: 没有待确认

source: Not recorded? The usual cause is "Amount" not connected to the trigger’s "Amount" variable; also check the automation is on and set to "Run Immediately". You can redo it under Settings ▸ Bookkeeping.
zh_hans: 没自动记上?最常见是「金额」没接上触发器的「金额 / Amount」变量;也确认自动化已开、选了「立即运行 / Run Immediately」。可到「设置 ▸ 记账」重做。

source: Not recorded automatically? Check: you built an email template, the automation’s sender is correct, and the action order is “Get Text → Ingest bank email” with the body parameter wired. You can redo this anytime from Settings ▸ Bookkeeping ▸ Email Auto-Recording.
zh_hans: 没自动记上?确认:已建邮件模版、自动化发件人填对了、动作顺序是「获取文本 → 处理银行邮件」且正文参数接对了。可随时回到「设置 ▸ 记账 ▸ 邮件自动记账」重做。

# 没自动记上?确认:自动化已开、选了「立即运行」、动作里金额/商户已正确映射。可随时回到「设置 ▸ 记账 ▸ Apple Pay 自动记账」重做。
source: Not recorded automatically? Check that the automation is on, set to Run Immediately, and that Amount/Merchant are mapped correctly in the action. You can redo this anytime from Settings ▸ Bookkeeping ▸ Apple Pay auto-tracking.
zh_hans: 没自动记上?确认:自动化已开、选了「立即运行」、动作里金额/商户已正确映射。可随时回到「设置 ▸ 记账 ▸ Apple Pay 自动记账」重做。

# 没自动记上?确认已建邮件模版、发件人填对、动作顺序是「获取文本 → 处理银行邮件」。可到「设置 ▸ 记账」重做。
source: Not recorded? Make sure you built an email template, the sender is correct, and the action order is Get Text → Process bank email. You can redo it under Settings ▸ Bookkeeping.
zh_hans: 没自动记上?确认已建邮件模版、发件人填对、动作顺序是「获取文本 → 处理银行邮件」。可到「设置 ▸ 记账」重做。

# 流水
source: Transactions
zh_hans: 流水

# 清除
source: Clear
zh_hans: 清除

# 游戏
source: Games
zh_hans: 游戏

# 点「完成 / Done」保存。
source: Tap “Done” to save.
zh_hans: 点「完成 / Done」保存。

# 点「完成 / Done」保存自动化。
source: Tap Done to save the automation.
zh_hans: 点「完成 / Done」保存自动化。

# 点「添加操作 / Add Action」,搜并选「处理银行短信」。
source: Tap “Add Action”, then search for and pick “Process bank SMS”.
zh_hans: 点「添加操作 / Add Action」,搜并选「处理银行短信」。

# 点「添加操作 / Add Action」,搜索并加「从输入获取文本 / Get Text from Input」。
source: Tap “Add Action”, search for and add “Get Text from Input”.
zh_hans: 点「添加操作 / Add Action」,搜索并加「从输入获取文本 / Get Text from Input」。

# 点「添加操作 / Add Action」,搜索并选「处理银行短信」(5分钱 提供的动作)。
source: Tap "Add Action", then search for and select "Ingest bank SMS" (provided by 5 cents).
zh_hans: 点「添加操作 / Add Action」,搜索并选「处理银行短信」(5分钱 提供的动作)。

# 点下面可重新标注金额／币种／商户／日期，改它「识别哪些交易」。
source: Tap below to re-tag the amount / currency / merchant / date and change which transactions it recognizes.
zh_hans: 点下面可重新标注金额／币种／商户／日期，改它「识别哪些交易」。

# 点下面可重新标注金额／币种／商户／日期，改它「识别哪些短信」。
source: Tap below to re-annotate the amount / currency / merchant / date and change WHICH messages it detects.
zh_hans: 点下面可重新标注金额／币种／商户／日期，改它「识别哪些短信」。

# 点下面按钮,用一条示例短信跑一遍记账。
source: Tap the button below to run bookkeeping once with a sample SMS.
zh_hans: 点下面按钮,用一条示例短信跑一遍记账。

# 点下面的按钮,会直接打开「新建自动化 / New Automation」,停在选择触发那一屏。
source: Tap the button below — it opens "New Automation" and lands right on the trigger picker.
zh_hans: 点下面的按钮,会直接打开「新建自动化 / New Automation」,停在选择触发那一屏。

# 点右上角 + 记一笔。
source: Tap + at the top right to add one.
zh_hans: 点右上角 + 记一笔。

# 点右上角「+」→(若出现)「创建个人自动化 / Create Personal Automation」。
source: Tap "+" in the top right, then (if shown) "Create Personal Automation".
zh_hans: 点右上角「+」→(若出现)「创建个人自动化 / Create Personal Automation」。

# 点右上角「+」准备新建一个个人自动化。
source: Tap + in the top-right to start a new personal automation.
zh_hans: 点右上角「+」准备新建一个个人自动化。

# 点词标注
source: Tag by tapping
zh_hans: 点词标注

# 版本
source: Version
zh_hans: 版本

# 现在就开始记你的第一笔吧。
source: Start recording your first entry now.
zh_hans: 现在就开始记你的第一笔吧。

# 用 (applicationName) 记一笔钱包
source: Add a Wallet transaction with \(applicationName)
zh_hans: 用 \(applicationName) 记一笔钱包

# 用 %@ 处理银行短信
source: Ingest bank SMS to %@
zh_hans: 用 %@ 处理银行短信

# 用 %@ 记一笔
source: Add a transaction to %@
zh_hans: 用 %@ 记一笔

# 用 Apple Pay / Apple Card 付款后自动记一笔。
source: Auto-log a transaction after you pay with Apple Pay / Apple Card.
zh_hans: 用 Apple Pay / Apple Card 付款后自动记一笔。

# 用 Apple Pay 全自动记账
source: Fully automatic tracking with Apple Pay
zh_hans: 用 Apple Pay 全自动记账

# 用一条内置示例短信,直接走一遍记账解析,看 app 这边通不通。
source: Run the logging parse on a built-in sample SMS to check the app side works.
zh_hans: 用一条内置示例短信,直接走一遍记账解析,看 app 这边通不通。

# 用这个备份覆盖当前全部数据？还原前会自动留一份当前数据的备份。
source: Overwrite all current data with this backup? A backup of the current data is saved automatically before restoring.
zh_hans: 用这个备份覆盖当前全部数据？还原前会自动留一份当前数据的备份。

# 用这条短信建模版
source: Build a template from this SMS
zh_hans: 用这条短信建模版

# 用邮件自动记账
source: Auto-record from email
zh_hans: 用邮件自动记账

# 相比短信自动记账:不用配关键词、不用逐家银行调模版,而且可以关掉运行通知。
source: Compared with SMS auto-tracking: no keywords to configure, no per-bank templates to tune — and you can turn off the run notification.
zh_hans: 相比短信自动记账:不用配关键词、不用逐家银行调模版,而且可以关掉运行通知。

# 短信
source: SMS
zh_hans: 短信

# 短信全文
source: Full Message
zh_hans: 短信全文

# 短信模版
source: SMS Templates
zh_hans: 短信模版

# 短信模版样例
source: Template example
zh_hans: 短信模版样例

# 短信自动记账
source: SMS auto-logging
zh_hans: 短信自动记账

# 确定
source: Confirm
zh_hans: 确定

# 确认识别结果
source: Confirm Detection
zh_hans: 确认识别结果

# 示例模版
source: Example Template
zh_hans: 示例模版

# 礼物
source: Gifts
zh_hans: 礼物

# 稍后可在「设置 ▸ 短信自动记账」里配置。
source: You can configure this later in Settings ▸ SMS auto-logging.
zh_hans: 稍后可在「设置 ▸ 短信自动记账」里配置。

# 立即重启
source: Restart Now
zh_hans: 立即重启

# 第一步:做一个「把短信喂给 app」的快捷指令
source: Step 1: make a shortcut that feeds the SMS to the app
zh_hans: 第一步:做一个「把短信喂给 app」的快捷指令

# 第一步:建一个快捷指令
source: Step 1: create a shortcut
zh_hans: 第一步:建一个快捷指令

# 第一步:打开「快捷指令」的自动化
source: Step 1: Open Automations in Shortcuts
zh_hans: 第一步:打开「快捷指令」的自动化

# 第一步:打开「快捷指令」自动化
source: Step 1: open Shortcuts Automation
zh_hans: 第一步:打开「快捷指令」自动化

# 第一步:选「钱包 / Wallet」触发
source: Step 1: pick the “Wallet” trigger
zh_hans: 第一步:选「钱包 / Wallet」触发

# 第三步:填银行发件人、立即运行
source: Step 3: enter the bank sender, run immediately
zh_hans: 第三步:填银行发件人、立即运行

# 第三步:接上记账动作
source: Step 3: connect the bookkeeping action
zh_hans: 第三步:接上记账动作

# 第三步:选卡、立即运行、关通知
source: Step 3: Pick cards, Run Immediately, mute notification
zh_hans: 第三步:选卡、立即运行、关通知

# 第三步:验证
source: Step 3: verify
zh_hans: 第三步:验证

# 第二步:建一个「信息」自动化
source: Step 2: create a “Messages” automation
zh_hans: 第二步:建一个「信息」自动化

# 第二步:选「邮件 / Email」触发
source: Step 2: pick the “Email” trigger
zh_hans: 第二步:选「邮件 / Email」触发

# 第二步:选卡、立即运行
source: Step 2: pick cards, run immediately
zh_hans: 第二步:选卡、立即运行

# 第四步:取出正文,交给 5分钱
source: Step 4: Extract the body, hand it to 5 cents
zh_hans: 第四步:取出正文,交给 5分钱

# 第四步:取出正文,交给记账动作
source: Step 4: extract the body, hand it to the bookkeeping action
zh_hans: 第四步:取出正文,交给记账动作

# 第四步:接上 5分钱 的记账动作
source: Step 4: Connect 5 cents's recording action
zh_hans: 第四步:接上 5分钱 的记账动作

# 简体中文
source: Simplified Chinese
zh_hans: 简体中文

# 类型
source: Type
zh_hans: 类型

# 线上购物
source: Online Shopping
zh_hans: 线上购物

# 线下购物
source: Shopping
zh_hans: 线下购物

# 结束
source: End
zh_hans: 结束

# 给它命名,例如「记账短信」,然后保存。
source: Name it, e.g. "SMS Logging", then save.
zh_hans: 给它命名,例如「记账短信」,然后保存。

# 统计
source: Stats
zh_hans: 统计

# 继续重算
source: Recompute
zh_hans: 继续重算

# 编辑
source: Edit
zh_hans: 编辑

# 编辑分类
source: Edit Category
zh_hans: 编辑分类

# 编辑周期交易
source: Edit Recurring
zh_hans: 编辑周期交易

# 编辑模版
source: Edit Template
zh_hans: 编辑模版

# 编辑识别规则
source: Edit detection rule
zh_hans: 编辑识别规则

# 自动化
source: Automation
zh_hans: 自动化

# 自动按从上到下的顺序逐条尝试识别，命中即停。拖动可调整顺序。
source: Templates are tried top to bottom and stop at the first match. Drag to reorder.
zh_hans: 自动按从上到下的顺序逐条尝试识别，命中即停。拖动可调整顺序。

# 自动按从上到下的顺序逐条尝试识别，命中即停。短信只试短信模版、邮件只试邮件模版。拖动可调整顺序。
source: Templates are tried top to bottom, stopping at the first match. SMS only tries SMS templates and email only tries email templates. Drag to reorder.
zh_hans: 自动按从上到下的顺序逐条尝试识别，命中即停。短信只试短信模版、邮件只试邮件模版。拖动可调整顺序。

# 自定义
source: Custom
zh_hans: 自定义

# 自定义范围
source: Custom Range
zh_hans: 自定义范围

# 若同一笔也来了银行短信或已用 Apple Pay 记过,app 会在待确认收件箱把后到的那条标记为「可能重复」,你拒绝即可,绝不会重复算两笔(除非确属两笔)。
source: If the same purchase also arrives by bank SMS or was already recorded via Apple Pay, the app flags the later one as “possibly duplicate” in the inbox — just reject it. It never double-counts (unless they really are two purchases).
zh_hans: 若同一笔也来了银行短信或已用 Apple Pay 记过,app 会在待确认收件箱把后到的那条标记为「可能重复」,你拒绝即可,绝不会重复算两笔(除非确属两笔)。

# 若某笔同时收到了银行短信,app 会在待确认收件箱把那条短信草稿标记为「可能与 Apple Pay 重复」,你拒绝即可,绝不会重复算两笔(除非确属两笔)。
source: If a payment also triggers a bank SMS, the app flags that SMS draft in the pending inbox as a possible Apple Pay duplicate — just reject it; you'll never be double-counted (unless they really are two purchases).
zh_hans: 若某笔同时收到了银行短信,app 会在待确认收件箱把那条短信草稿标记为「可能与 Apple Pay 重复」,你拒绝即可,绝不会重复算两笔(除非确属两笔)。

# 要修改它「识别哪些短信」，请删除后用一条新短信重新创建。
source: To change WHICH messages it detects, delete it and re-create from a new SMS.
zh_hans: 要修改它「识别哪些短信」，请删除后用一条新短信重新创建。

# 覆盖范围:仅「钱包」内线下刷卡(tap-to-pay)。现金、网银转账、未走 Apple Pay 的网购,仍需短信自动记账或手动补。
source: Coverage: in-person Wallet tap-to-pay only. Cash, bank transfers, and online purchases not paid via Apple Pay still need SMS auto-tracking or manual entry.
zh_hans: 覆盖范围:仅「钱包」内线下刷卡(tap-to-pay)。现金、网银转账、未走 Apple Pay 的网购,仍需短信自动记账或手动补。

# 触发关键词(已复制到剪贴板)
source: Trigger keyword (copied to clipboard)
zh_hans: 触发关键词(已复制到剪贴板)

# 让「收到含关键词的短信」就自动跑刚才那个快捷指令。关键词我已经帮你复制好了,到那一步直接长按粘贴即可。
source: Make "a message containing the keyword arrives" automatically run the shortcut you just made. The keyword is already copied — when you reach that step, just long-press and paste.
zh_hans: 让「收到含关键词的短信」就自动跑刚才那个快捷指令。关键词我已经帮你复制好了,到那一步直接长按粘贴即可。

# 让这个自动化在每笔交易时,把「商户 / 金额」交给 5分钱 自动入账。
source: Have this automation hand the merchant and amount of each transaction to 5 cents for automatic recording.
zh_hans: 让这个自动化在每笔交易时,把「商户 / 金额」交给 5分钱 自动入账。

# 记一笔
source: Add
zh_hans: 记一笔

# 记一笔 %@ %@ 到 %@
source: Add %@ %@ to %@
zh_hans: 记一笔 %@ %@ 到 %@

# 记一笔交易到 5分钱（外币自动换算成 SGD）。
source: Record a transaction in 5 cents (foreign amounts auto-converted to SGD).
zh_hans: 记一笔交易到 5分钱（外币自动换算成 SGD）。

# 记录钱包交易
source: Record Wallet transaction
zh_hans: 记录钱包交易

# 记账
source: Bookkeeping
zh_hans: 记账

# 设完点「下一步 / Next」,进入设置要运行的动作。
source: When done, tap Next to set up the action to run.
zh_hans: 设完点「下一步 / Next」,进入设置要运行的动作。

# 设置
source: Settings
zh_hans: 设置

# 设置完成
source: Setup complete
zh_hans: 设置完成

# 识别字段（可修改）
source: Detected Fields (editable)
zh_hans: 识别字段（可修改）

# 识别模版
source: Recognition Templates
zh_hans: 识别模版

# 识别银行交易短信，还是交易邮件？
source: Recognize bank transaction SMS, or transaction email?
zh_hans: 识别银行交易短信，还是交易邮件？

# 该分类「%@」下有 %lld 条交易，删除后这些交易将变为「未分类」（交易不会被删除）。
source: Category “%@” has %lld transaction(s). Deleting it will mark them as Uncategorized (the transactions are not deleted).
zh_hans: 该分类「%@」下有 %lld 条交易，删除后这些交易将变为「未分类」（交易不会被删除）。

# 该范围暂无支出
source: No expenses in this range
zh_hans: 该范围暂无支出

# 语言
source: Language
zh_hans: 语言

# 语言已切换,重启 App 后生效
source: Language changed. Restart the app to apply.
zh_hans: 语言已切换，重启 App 后生效

# 请先选中「%@」。
source: Please tag “%@” first.
zh_hans: 请先选中「%@」。

# 请填写%@。
source: Please enter %@.
zh_hans: 请填写%@。

# 跟着下面三步做,以后收到银行短信就自动记一笔。
source: Do the three steps below, and bank SMS will be recorded automatically from now on.
zh_hans: 跟着下面三步做,以后收到银行短信就自动记一笔。

# 跟着下面三步做,以后用「钱包」里的卡线下刷 Apple Pay 就自动记一笔。
source: Do the three steps below, and every in-store Apple Pay tap with a card in Wallet will be recorded automatically.
zh_hans: 跟着下面三步做,以后用「钱包」里的卡线下刷 Apple Pay 就自动记一笔。

# 跟着下面四步做,以后收到银行交易邮件就自动记一笔。
source: Do the four steps below, and bank transaction emails will be recorded automatically from now on.
zh_hans: 跟着下面四步做,以后收到银行交易邮件就自动记一笔。

# 跟着下面的图文步骤即可完成;视频演示与一键导入稍后补充。
source: Follow the illustrated steps below; a video walkthrough and one-tap import are coming later.
zh_hans: 跟着下面的图文步骤即可完成;视频演示与一键导入稍后补充。

# 跟着下面的图文步骤即可完成;视频演示稍后补充。
source: Just follow the step-by-step cards below; a video demo is coming soon.
zh_hans: 跟着下面的图文步骤即可完成;视频演示稍后补充。

# 跟着做,建一个自动短信触发
source: Follow along to set up an automatic SMS trigger
zh_hans: 跟着做,建一个自动短信触发

# 跟随系统
source: Follow System
zh_hans: 跟随系统

# 跳过
source: Skip
zh_hans: 跳过

# 运动
source: Sports
zh_hans: 运动

# 还原失败
source: Restore Failed
zh_hans: 还原失败

# 还原已就绪
source: Restore Ready
zh_hans: 还原已就绪

# 还原并覆盖
source: Restore & Overwrite
zh_hans: 还原并覆盖

# 还没有模版。点右上角「+」，粘贴一条交易短信或一封交易邮件来新建。
source: No templates yet. Tap “+” in the top right and paste a transaction SMS or email to create one.
zh_hans: 还没有模版。点右上角「+」，粘贴一条交易短信或一封交易邮件来新建。

# 还没有短信模版。点右上角「+」，粘贴一条你银行的交易短信来新建。
source: No SMS templates yet. Tap “+” in the top right and paste one of your bank's transaction SMS to create one.
zh_hans: 还没有短信模版。点右上角「+」，粘贴一条你银行的交易短信来新建。

# 还没有选中任何内容。选「金额」类别并点出金额至少一项。
source: Nothing tagged yet. Pick the Amount category and tap at least the amount.
zh_hans: 还没有选中任何内容。选「金额」类别并点出金额至少一项。

# 这一点优于短信自动记账:Apple Pay 自动化的运行通知可以关掉。
source: An edge over SMS auto-tracking: the Apple Pay automation's run notification can be turned off.
zh_hans: 这一点优于短信自动记账:Apple Pay 自动化的运行通知可以关掉。

# 这时已经在「选择操作 / Choose Action」页。在搜索框搜「记录钱包交易」,选本 app 的这个操作。
source: You’re now on the "Choose Action" screen. Search "Record Wallet transaction" and pick this app’s action.
zh_hans: 这时已经在「选择操作 / Choose Action」页。在搜索框搜「记录钱包交易」,选本 app 的这个操作。

# 这里只改产出设置（名称、类型、默认分类、币种回退、启用）。要修改它「识别哪些短信」，请删除后用一条新短信重新创建。
source: This only edits output settings (name, type, default category, currency fallback, enabled). To change WHICH messages it detects, delete it and re-create from a new SMS.
zh_hans: 这里只改产出设置（名称、类型、默认分类、币种回退、启用）。要修改它「识别哪些短信」，请删除后用一条新短信重新创建。

# 选「立即运行 / Run Immediately」,点「下一步 / Next」。
source: Choose “Run Immediately”, then tap “Next”.
zh_hans: 选「立即运行 / Run Immediately」,点「下一步 / Next」。

# 选「立即运行 / Run Immediately」,点「完成 / Done」。
source: Choose “Run Immediately”, then tap “Done”.
zh_hans: 选「立即运行 / Run Immediately」,点「完成 / Done」。

# 选「立即运行 / Run Immediately」。
source: Choose “Run Immediately”.
zh_hans: 选「立即运行 / Run Immediately」。

# 选中内容（可编辑）
source: Selected (editable)
zh_hans: 选中内容（可编辑）

# 选卡
source: Cards
zh_hans: 选卡

# 选择币种
source: Select Currency
zh_hans: 选择币种

# 选择本位币
source: Choose your base currency
zh_hans: 选择本位币

# 选择要运行的快捷指令 → 选刚建的「记账短信」。
source: Choose the shortcut to run → pick the "SMS Logging" you just made.
zh_hans: 选择要运行的快捷指令 → 选刚建的「记账短信」。

# 选择要追踪的卡——想全自动建议「全选」你常用的卡。
source: Choose the cards to track — for full automation, select all the cards you use.
zh_hans: 选择要追踪的卡——想全自动建议「全选」你常用的卡。

# 选要运行的快捷指令「记账短信」。
source: Pick the shortcut to run: “Bookkeeping SMS”.
zh_hans: 选要运行的快捷指令「记账短信」。

# 选钱包
source: Wallet
zh_hans: 选钱包

# 通用
source: General
zh_hans: 通用

# 通讯
source: Phone & Internet
zh_hans: 通讯

# 邮件
source: Email
zh_hans: 邮件

# 邮件模版
source: Email Template
zh_hans: 邮件模版

# 邮件模版样例（关键段）
source: Email template sample (key segment)
zh_hans: 邮件模版样例（关键段）

# 邮件正文是「文件」,要先转成文本再喂给记账动作。两步动作,顺序很重要。
source: The email body is a file; convert it to text before passing it to the recording action. Two actions — order matters.
zh_hans: 邮件正文是「文件」,要先转成文本再喂给记账动作。两步动作,顺序很重要。

# 邮件正文是以「文件」形态传入的(文件名=主题、内容=正文),所以快捷指令里要多加一步「从输入获取文本」把正文取出来。下面会带你做。
source: The email body arrives as a file (name = subject, contents = body), so the Shortcut needs one extra “Get Text from Input” step to extract the body. We’ll guide you through it.
zh_hans: 邮件正文是以「文件」形态传入的(文件名=主题、内容=正文),所以快捷指令里要多加一步「从输入获取文本」把正文取出来。下面会带你做。

# 邮件自动记账
source: Email Auto-Recording
zh_hans: 邮件自动记账

# 邮件自动记账已就绪,下次来一封交易邮件即自动记一笔待确认。
source: Email auto-recording is ready — your next transaction email will become a pending draft automatically.
zh_hans: 邮件自动记账已就绪,下次来一封交易邮件即自动记一笔待确认。

# 邮件自动记账已就绪。下次来一封交易邮件即自动识别成待确认草稿,你在收件箱确认即可。
source: Email auto-recording is ready. The next transaction email is automatically turned into a draft; just confirm it in the inbox.
zh_hans: 邮件自动记账已就绪。下次来一封交易邮件即自动识别成待确认草稿,你在收件箱确认即可。

# 配一次,以后每次用「钱包」里的卡线下刷 Apple Pay,都会自动记一笔——无需关键词、无需确认、0 点按。下面带你建这唯一一次自动化。
source: Set it up once: from then on, every in-person Apple Pay payment with a card in your Wallet is recorded automatically — no keywords, no confirmation, zero taps. Below we'll walk you through building that one automation.
zh_hans: 配一次,以后每次用「钱包」里的卡线下刷 Apple Pay,都会自动记一笔——无需关键词、无需确认、0 点按。下面带你建这唯一一次自动化。

# 重新复制
source: Copy again
zh_hans: 重新复制

# 金额
source: Amount
zh_hans: 金额

# 金额可能带货币符号或负号,5分钱 会自动识别成正数支出,无需你处理。
source: The amount may include a currency symbol or minus sign — 5 cents reads it as a positive expense automatically, nothing for you to do.
zh_hans: 金额可能带货币符号或负号,5分钱 会自动识别成正数支出,无需你处理。

# 金额必须大于 0。
source: Amount must be greater than 0.
zh_hans: 金额必须大于 0。

# 银行短信
source: Bank SMS
zh_hans: 银行短信

# 银行短信或邮件自动录入的待确认草稿会出现在这里。
source: Drafts auto-captured from bank SMS or email will appear here for confirmation.
zh_hans: 银行短信或邮件自动录入的待确认草稿会出现在这里。

# 银行短信自动录入的待确认草稿会出现在这里。
source: Pending drafts captured automatically from bank SMS appear here.
zh_hans: 银行短信自动录入的待确认草稿会出现在这里。

# 随手记一笔，账目了然于心。
source: Jot down every expense, keep your finances clear.
zh_hans: 随手记一笔，账目了然于心。

# 非记账短信，已忽略。
source: Not a transaction SMS; ignored.
zh_hans: 非记账短信，已忽略。

# 顺序很关键:必须先「获取文本」、再「处理银行邮件」,且后者的正文参数接前者的输出。否则会把 HTML 文件原样喂进来,认不出。
source: Order is crucial: “Get Text” first, then “Ingest bank email”, with the body parameter wired to the former’s output. Otherwise the raw HTML file is passed in and won’t be recognized.
zh_hans: 顺序很关键:必须先「获取文本」、再「处理银行邮件」,且后者的正文参数接前者的输出。否则会把 HTML 文件原样喂进来,认不出。

# 顺序必须是先「获取文本」、再「处理银行邮件」,否则认不出。
source: The order must be Get Text first, then Process bank email — otherwise it won't be recognized.
zh_hans: 顺序必须是先「获取文本」、再「处理银行邮件」,否则认不出。

# 预置
source: Preset
zh_hans: 预置

# 预防针:选了「立即运行」后,iOS 每次自动记账都会发一条系统通知,这是系统规定、关不掉,属正常,不是 bug。
source: Heads-up: once "Run Immediately" is on, iOS posts a system notification on every auto-logged transaction. This is required by the system and can't be turned off — it's normal, not a bug.
zh_hans: 预防针:选了「立即运行」后,iOS 每次自动记账都会发一条系统通知,这是系统规定、关不掉,属正常,不是 bug。

# 餐饮
source: Food & Drink
zh_hans: 餐饮

# 验证
source: Verify
zh_hans: 验证

# 默认分类
source: Default Category
zh_hans: 默认分类
